Tekla Open API Reference for Tekla Structures 2025
CustomPartPositioningTypeAttribute Constructor (CustomPartBase.CustomPartPositioningType)
 The custom attribute uses this to store the positioning type to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CustomPartPositioningTypeAttribute(
	CustomPartBase.CustomPartPositioningType Type
)
Public Sub New (
	Type As CustomPartBase.CustomPartPositioningType
)
Parameters
Type
Type: Tekla.Structures.Plugins.CustomPartBase.CustomPartPositioningType
The custom part positioning type.
See Also
Reference
CustomPartPositioningTypeAttribute Class
CustomPartPositioningTypeAttribute Overload
Tekla.Structures.Plugins Namespace